In [1]:
#4 import the required packages
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import scipy.stats as stats
import statsmodels.api as sm
%matplotlib inline

In [2]:
#read the fullsmple file

initial = 'data/fullsample.csv'
initial_data = pd.read_csv(initial)

In [3]:
initial_data.shape

(4365379, 12)

In [4]:
initial_data.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
0,6794220,laxtons,mikala,247808Mn,115217.12M,14-00:00:00,11-01:32:50,1,16,production,0:0,2019-03-09T16:38:44
1,6983193_1880,discovery,serina,12288Mn,6516.10M,13-18:00:00,12-09:26:41,1,1,production,0:0,2019-03-07T18:39:59
2,7055502_1863,discovery,serina,12288Mn,0.09M,13-18:00:00,13-08:27:36,1,1,production,0:0,2019-03-11T10:06:06
3,7055502_1800,discovery,serina,12288Mn,8333.82M,13-18:00:00,12-03:50:59,1,1,production,0:0,2019-03-11T10:06:06
4,7055502_1806,discovery,serina,12288Mn,8304.03M,13-18:00:00,11-08:43:46,1,1,production,0:0,2019-03-11T10:06:06

In [5]:
initial_data.tail()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
4365374,12741062_145,mickey,boyce,4096Mc,462.90M,00:10:00,00:01:44,1,1,production,0:0,2019-09-25T14:22:03
4365375,12741062_146,mickey,boyce,4096Mc,462.89M,00:10:00,00:01:44,1,1,production,0:0,2019-09-25T14:22:03
4365376,12741062_147,mickey,boyce,4096Mc,553.77M,00:10:00,00:01:53,1,1,production,0:0,2019-09-25T14:22:03
4365377,12741062_148,mickey,boyce,4096Mc,557.09M,00:10:00,00:01:52,1,1,production,0:0,2019-09-25T14:22:03
4365378,12741062_149,mickey,boyce,4096Mc,616.77M,00:10:00,00:01:52,1,1,production,0:0,2019-09-25T14:22:03

In [6]:
initial_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4365379 entries, 0 to 4365378
Data columns (total 12 columns):
JOBID        object
ACCOUNT      object
USER         object
REQMEM       object
USEDMEM      object
REQTIME      object
USEDTIME     object
NODES        int64
CPUS         int64
PARTITION    object
EXITCODE     object
SUBMIT       object
dtypes: int64(2), object(10)
memory usage: 399.7+ MB

In [7]:
initial_data.columns

Index(['JOBID', 'ACCOUNT', 'USER', 'REQMEM', 'USEDMEM', 'REQTIME', 'USEDTIME',
       'NODES', 'CPUS', 'PARTITION', 'EXITCODE', 'SUBMIT'],
      dtype='object')

In [8]:
#remove duplicate rows
initial_data=initial_data.drop_duplicates()

In [9]:
initial_data.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
0,6794220,laxtons,mikala,247808Mn,115217.12M,14-00:00:00,11-01:32:50,1,16,production,0:0,2019-03-09T16:38:44
1,6983193_1880,discovery,serina,12288Mn,6516.10M,13-18:00:00,12-09:26:41,1,1,production,0:0,2019-03-07T18:39:59
2,7055502_1863,discovery,serina,12288Mn,0.09M,13-18:00:00,13-08:27:36,1,1,production,0:0,2019-03-11T10:06:06
3,7055502_1800,discovery,serina,12288Mn,8333.82M,13-18:00:00,12-03:50:59,1,1,production,0:0,2019-03-11T10:06:06
4,7055502_1806,discovery,serina,12288Mn,8304.03M,13-18:00:00,11-08:43:46,1,1,production,0:0,2019-03-11T10:06:06

In [10]:
#keep only data that has partition= production 
initial_data=initial_data.loc[initial_data['PARTITION']=='production']

In [11]:
initial_data.shape

(3319257, 12)

In [12]:
#keep only successful jobs. meaning keep all exit code that contain 0:0
#initial_data=initial_data.loc[initial_data['EXITCODE']=='0:0']
#we will use this for qeustions 3 and 4

In [13]:
initial_data.shape

(3319257, 12)

In [14]:
initial_data.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
0,6794220,laxtons,mikala,247808Mn,115217.12M,14-00:00:00,11-01:32:50,1,16,production,0:0,2019-03-09T16:38:44
1,6983193_1880,discovery,serina,12288Mn,6516.10M,13-18:00:00,12-09:26:41,1,1,production,0:0,2019-03-07T18:39:59
2,7055502_1863,discovery,serina,12288Mn,0.09M,13-18:00:00,13-08:27:36,1,1,production,0:0,2019-03-11T10:06:06
3,7055502_1800,discovery,serina,12288Mn,8333.82M,13-18:00:00,12-03:50:59,1,1,production,0:0,2019-03-11T10:06:06
4,7055502_1806,discovery,serina,12288Mn,8304.03M,13-18:00:00,11-08:43:46,1,1,production,0:0,2019-03-11T10:06:06

In [15]:
#remove the - from the reqtime and usedtime
initial_data.REQTIME=initial_data.REQTIME.str.replace('-',':')
initial_data.USEDTIME=initial_data.USEDTIME.str.replace('-',':')

In [16]:
initial_data.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
0,6794220,laxtons,mikala,247808Mn,115217.12M,14:00:00:00,11:01:32:50,1,16,production,0:0,2019-03-09T16:38:44
1,6983193_1880,discovery,serina,12288Mn,6516.10M,13:18:00:00,12:09:26:41,1,1,production,0:0,2019-03-07T18:39:59
2,7055502_1863,discovery,serina,12288Mn,0.09M,13:18:00:00,13:08:27:36,1,1,production,0:0,2019-03-11T10:06:06
3,7055502_1800,discovery,serina,12288Mn,8333.82M,13:18:00:00,12:03:50:59,1,1,production,0:0,2019-03-11T10:06:06
4,7055502_1806,discovery,serina,12288Mn,8304.03M,13:18:00:00,11:08:43:46,1,1,production,0:0,2019-03-11T10:06:06

In [17]:
date_time=initial_data.REQTIME

In [18]:
%%time
#covert the REQTIME to total seconds
#initialize the to_secods df outside of the loop
to_seconds=[]
for time in date_time:
    split=time.split(':')
    if len(split)==4:
        seconds=int(split[0])*86400+int(split[1])*3600+int(split[2])*60+int(split[3])
        to_seconds.append(seconds)
    else:
        seconds=int(split[0])*3600+int(split[1])*60+int(split[2])
        to_seconds.append(seconds)

CPU times: user 6.18 s, sys: 64.2 ms, total: 6.24 s
Wall time: 6.24 s

In [19]:
#now set the results of the loop back in the REQTIME column
initial_data['REQTIME']=to_seconds

In [20]:
initial_data.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
0,6794220,laxtons,mikala,247808Mn,115217.12M,1209600,11:01:32:50,1,16,production,0:0,2019-03-09T16:38:44
1,6983193_1880,discovery,serina,12288Mn,6516.10M,1188000,12:09:26:41,1,1,production,0:0,2019-03-07T18:39:59
2,7055502_1863,discovery,serina,12288Mn,0.09M,1188000,13:08:27:36,1,1,production,0:0,2019-03-11T10:06:06
3,7055502_1800,discovery,serina,12288Mn,8333.82M,1188000,12:03:50:59,1,1,production,0:0,2019-03-11T10:06:06
4,7055502_1806,discovery,serina,12288Mn,8304.03M,1188000,11:08:43:46,1,1,production,0:0,2019-03-11T10:06:06

In [21]:
#used_time=initial_data.USEDTIME

In [22]:
#covert the USEDTIME to total seconds
#another way to do seconds conversion. do a function 
def convert_to_seconds(new):
    split_again=new.split(':')
    if len(split_again)==4:
        sec_2=int(split_again[0])*86400+int(split_again[1])*3600+int(split_again[2])*60+int(split_again[3])
        
    else:
        sec_2=int(split_again[0])*3600+int(split_again[1])*60+int(split_again[2])
        
    return sec_2

In [23]:
#my function worked
convert_to_seconds('11:01:32:50')

955970

In [24]:
%%time
#use the fuction created to covert the USEDTIME column to seconds
initial_data.USEDTIME=initial_data.USEDTIME.apply(convert_to_seconds)

CPU times: user 5.98 s, sys: 171 ms, total: 6.15 s
Wall time: 5.96 s

In [25]:
#initial_data.head()

In [26]:
reqmem=initial_data['REQMEM'].str.replace(r'(Mn|Mc)',r' \1')
#split=reqmem.str.split(' ')
initial_data.REQMEM=reqmem

In [27]:
initial_data.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
0,6794220,laxtons,mikala,247808 Mn,115217.12M,1209600,955970,1,16,production,0:0,2019-03-09T16:38:44
1,6983193_1880,discovery,serina,12288 Mn,6516.10M,1188000,1070801,1,1,production,0:0,2019-03-07T18:39:59
2,7055502_1863,discovery,serina,12288 Mn,0.09M,1188000,1153656,1,1,production,0:0,2019-03-11T10:06:06
3,7055502_1800,discovery,serina,12288 Mn,8333.82M,1188000,1050659,1,1,production,0:0,2019-03-11T10:06:06
4,7055502_1806,discovery,serina,12288 Mn,8304.03M,1188000,981826,1,1,production,0:0,2019-03-11T10:06:06

In [28]:
#convert Mn to Mc using a function 
def convert_to_mc(x,y,z):
    #cut_mn=x.replace(r'(Mn|Mc)',r' \1')
    num_unit=x.split(' ')
    #print(num_unit[0])
    number=int(num_unit[0])
    unit=num_unit[1]
    if unit=='Mn':
        mc_conversion=(number*y)/(z)
    else:
        mc_conversion=number
        
    return mc_conversion

In [29]:
%%time
initial_data['REQMEM']=initial_data.apply(lambda row: convert_to_mc(row['REQMEM'],row['NODES'],row['CPUS']),axis=1)

CPU times: user 1min 53s, sys: 1.17 s, total: 1min 54s
Wall time: 1min 54s

In [30]:
initial_data.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
0,6794220,laxtons,mikala,15488.0,115217.12M,1209600,955970,1,16,production,0:0,2019-03-09T16:38:44
1,6983193_1880,discovery,serina,12288.0,6516.10M,1188000,1070801,1,1,production,0:0,2019-03-07T18:39:59
2,7055502_1863,discovery,serina,12288.0,0.09M,1188000,1153656,1,1,production,0:0,2019-03-11T10:06:06
3,7055502_1800,discovery,serina,12288.0,8333.82M,1188000,1050659,1,1,production,0:0,2019-03-11T10:06:06
4,7055502_1806,discovery,serina,12288.0,8304.03M,1188000,981826,1,1,production,0:0,2019-03-11T10:06:06

In [31]:
usedmem=initial_data['USEDMEM'].str.replace(r'(M)',r' \1')
initial_data.USEDMEM=usedmem

In [32]:
#initial_data.head()

In [33]:
initial_data.shape

(3319257, 12)

In [34]:
initial_data.loc[initial_data['CPUS']==0]
#or you can use this 
#initial_data[initial_data['CPUS']==0]

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
1556155,9524253,kumquat,kate,16384.0,16383.34 M,86400,35114,24,0,production,0:0,2019-07-01T14:22:00

In [35]:
#find the index of the row you wanted deleted 
initial_data[initial_data['CPUS']==0].index

Int64Index([1556155], dtype='int64')

In [36]:
#delet the row using the index id of the row you want deleted. 
initial_data.drop(initial_data[initial_data['CPUS']==0].index,inplace=True)
#dfObj.drop( dfObj[ dfObj['Age'] == 30 ].index , inplace=True)

In [37]:
initial_data.shape

(3319256, 12)

In [38]:
initial_data[initial_data['USEDMEM']=='0'].head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
3645,7239987_1,almonds,robt,4096.0,0,1800,20,1,1,production,0:0,2019-03-20T07:31:32
4233,7241024_4,clara,gemma,8192.0,0,7200,6,1,1,production,0:0,2019-03-20T08:32:02
4235,7241024_2,clara,gemma,8192.0,0,7200,5,1,1,production,0:0,2019-03-20T08:32:02
4236,7241024_3,clara,gemma,8192.0,0,7200,4,1,1,production,0:0,2019-03-20T08:32:02
4239,7241033_1,clara,gemma,8192.0,0,7200,32,1,1,production,0:0,2019-03-20T08:33:03

In [39]:
#convert Mn to Mc using a function 
def m_to_mc(a,b,c):
    #cut_mn=a.replace(r'(M)',r' \1')
    if a =='0':
        mc=a
    else:
        split_it=a.split(' ')
        value=float(split_it[0])
        letter=split_it[1]
        mc=(value*b)/(c)
        
    return mc

In [40]:
%%time
initial_data['USEDMEM']=initial_data.apply(lambda row: m_to_mc(row['USEDMEM'],row['NODES'],row['CPUS']),axis=1)

CPU times: user 1min 54s, sys: 1.25 s, total: 1min 56s
Wall time: 1min 56s

In [41]:
#exproted my clean data to use for other steps
export_clean_data=initial_data.to_csv('data/clean_data.csv',index=None)

In [42]:
initial_data.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
0,6794220,laxtons,mikala,15488.0,7201.07,1209600,955970,1,16,production,0:0,2019-03-09T16:38:44
1,6983193_1880,discovery,serina,12288.0,6516.1,1188000,1070801,1,1,production,0:0,2019-03-07T18:39:59
2,7055502_1863,discovery,serina,12288.0,0.09,1188000,1153656,1,1,production,0:0,2019-03-11T10:06:06
3,7055502_1800,discovery,serina,12288.0,8333.82,1188000,1050659,1,1,production,0:0,2019-03-11T10:06:06
4,7055502_1806,discovery,serina,12288.0,8304.03,1188000,981826,1,1,production,0:0,2019-03-11T10:06:06

In [43]:
#using a new data frame to only have array jobs. 
array_only_ids=initial_data

In [44]:
#array_jobs=array_only_ids[['JOBID']]
#array_jobs.head()

In [45]:
%%time 
def array_jobs(job):
    array_split=job.split('_')
    if len(array_split)==2:
        jobs=job#array_split
    else:
        jobs=0
        
    return jobs

CPU times: user 4 s, sys: 2 s, total: 6 s
Wall time: 10 s

In [46]:
%time
array_only_ids.JOBID=array_only_ids.JOBID.apply(array_jobs)
#initial_data.USEDTIME=initial_data.USEDTIME.apply(convert_to_seconds)

CPU times: user 5 s, sys: 2 s, total: 7 s
Wall time: 11 s

In [47]:
array_only_ids.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
0,0,laxtons,mikala,15488.0,7201.07,1209600,955970,1,16,production,0:0,2019-03-09T16:38:44
1,6983193_1880,discovery,serina,12288.0,6516.1,1188000,1070801,1,1,production,0:0,2019-03-07T18:39:59
2,7055502_1863,discovery,serina,12288.0,0.09,1188000,1153656,1,1,production,0:0,2019-03-11T10:06:06
3,7055502_1800,discovery,serina,12288.0,8333.82,1188000,1050659,1,1,production,0:0,2019-03-11T10:06:06
4,7055502_1806,discovery,serina,12288.0,8304.03,1188000,981826,1,1,production,0:0,2019-03-11T10:06:06

In [48]:
array_only_ids.drop(array_only_ids[array_only_ids['JOBID']==0].index,inplace=True)

In [49]:
array_only_ids.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
1,6983193_1880,discovery,serina,12288.0,6516.1,1188000,1070801,1,1,production,0:0,2019-03-07T18:39:59
2,7055502_1863,discovery,serina,12288.0,0.09,1188000,1153656,1,1,production,0:0,2019-03-11T10:06:06
3,7055502_1800,discovery,serina,12288.0,8333.82,1188000,1050659,1,1,production,0:0,2019-03-11T10:06:06
4,7055502_1806,discovery,serina,12288.0,8304.03,1188000,981826,1,1,production,0:0,2019-03-11T10:06:06
5,7055502_1823,discovery,serina,12288.0,7693.11,1188000,789220,1,1,production,0:0,2019-03-11T10:06:06

In [50]:
array_only_ids[['number','sub_number']]=array_only_ids.JOBID.str.split('_',expand=True)

In [51]:
array_only_ids.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT,number,sub_number
1,6983193_1880,discovery,serina,12288.0,6516.1,1188000,1070801,1,1,production,0:0,2019-03-07T18:39:59,6983193,1880
2,7055502_1863,discovery,serina,12288.0,0.09,1188000,1153656,1,1,production,0:0,2019-03-11T10:06:06,7055502,1863
3,7055502_1800,discovery,serina,12288.0,8333.82,1188000,1050659,1,1,production,0:0,2019-03-11T10:06:06,7055502,1800
4,7055502_1806,discovery,serina,12288.0,8304.03,1188000,981826,1,1,production,0:0,2019-03-11T10:06:06,7055502,1806
5,7055502_1823,discovery,serina,12288.0,7693.11,1188000,789220,1,1,production,0:0,2019-03-11T10:06:06,7055502,1823

In [52]:
array_only_ids.shape

(2575548, 14)

In [53]:
#array_only_ids.number[array_only_ids.USEDTIME<300]

In [54]:
#give me only data with USEDTIME <300 i.e. 5 minutes
array_only_ids=array_only_ids[array_only_ids.USEDTIME<300]

In [55]:
array_only_ids.shape

(696855, 14)

In [56]:
array_of_ids=array_only_ids.groupby(['number','USER','EXITCODE'],as_index=False)[['JOBID']].count()

In [57]:
array_of_ids.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 17488 entries, 0 to 17487
Data columns (total 4 columns):
number      17488 non-null object
USER        17488 non-null object
EXITCODE    17488 non-null object
JOBID       17488 non-null int64
dtypes: int64(1), object(3)
memory usage: 683.1+ KB

In [159]:
#this is the users who commited <500 jobs that were <5 minutes.
array_of_ids.head()

      number      USER EXITCODE  JOBID
30  10021254  demarcus      0:0   6297
54  10081102   lashawn      0:0   1200
64  10094343  demarcus      0:0   6046
65  10100906  demarcus      0:0   7606
66  10100910  demarcus      0:0   7548

In [59]:
array_of_ids=array_of_ids[array_of_ids.JOBID>500]

In [60]:
#This is the number of times each person committed that criteria
array_of_ids.groupby('USER')[['number']].count()

          number
USER
alf            3
alisson        1
archie         2
baylee         7
benson        19
boyce         31
brande        22
demarcus       7
hjalmar        2
jermaine       1
kaye           1
lashawn        2
macey          1
obie           3
osborne        1
pamelia        1
somer          1
stefanie       1
tegan          2
tommie        62
vaughn         1
whitley        6

In [102]:
#this shows that all these long arrays of short jobs had exitcode of 0:0
#array_of_ids[array_of_ids.EXITCODE=='0:0']

In [128]:
#bring in clean data in new dataframe to work with part 2 of questions one which asks:
#Lots of small jobs submitted together within a 4-hour window,regardless of whether or not they were in an array
er='data/clean_data.csv'
error_code = pd.read_csv(er)

In [129]:
error_code.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
0,6794220,laxtons,mikala,15488.0,7201.07,1209600,955970,1,16,production,0:0,2019-03-09T16:38:44
1,6983193_1880,discovery,serina,12288.0,6516.10,1188000,1070801,1,1,production,0:0,2019-03-07T18:39:59
2,7055502_1863,discovery,serina,12288.0,0.09,1188000,1153656,1,1,production,0:0,2019-03-11T10:06:06
3,7055502_1800,discovery,serina,12288.0,8333.82,1188000,1050659,1,1,production,0:0,2019-03-11T10:06:06
4,7055502_1806,discovery,serina,12288.0,8304.03,1188000,981826,1,1,production,0:0,2019-03-11T10:06:06

In [131]:
error_code.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
0,6794220,laxtons,mikala,15488.0,7201.07,1209600,955970,1,16,production,0:0,2019-03-09 16:38:44
1,6983193_1880,discovery,serina,12288.0,6516.10,1188000,1070801,1,1,production,0:0,2019-03-07 18:39:59
2,7055502_1863,discovery,serina,12288.0,0.09,1188000,1153656,1,1,production,0:0,2019-03-11 10:06:06
3,7055502_1800,discovery,serina,12288.0,8333.82,1188000,1050659,1,1,production,0:0,2019-03-11 10:06:06
4,7055502_1806,discovery,serina,12288.0,8304.03,1188000,981826,1,1,production,0:0,2019-03-11 10:06:06

In [133]:
#how many jobs were unsuccessful. i.e. exitcode not equal '0:0'
error_code=error_code[error_code.EXITCODE!='0:0']
#array_only_ids=array_only_ids[array_only_ids.USEDTIME<300]

In [140]:
error_code.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
16652,7269184,atemoyas,benson,1024.0,1023.83,1500,1435,1,1,production,0:125,2019-03-21 18:38:42
23910,7281699,pinole,christa,1024.0,430.72,1800,41,2,1,production,7:0,2019-03-22 08:37:35
24000,7281822,pinole,christa,6144.0,0.00,1800,22,1,1,production,7:0,2019-03-22 08:47:42
24274,7282440,blood,jonnie,12288.0,0.18,1800,19,2,1,production,7:0,2019-03-22 09:36:29
24394,7282671,pinole,christa,1024.0,0.16,1800,31,2,1,production,7:0,2019-03-22 10:06:30

In [143]:
#shows the accounts and user of each account and how many jobs they committed that failed. 
error_code.groupby(['ACCOUNT','USER'])[['JOBID']].count()

                       JOBID
ACCOUNT     USER
atemoyas    benson         1
baby        christina      1
blood       jonnie         4
carrot      ari            1
cep         tremaine       1
cepuna      luvinia        1
chanterelle adalyn         2
durondeau   ginger         9
forelle     cleva          5
kumquat     icey           5
laxtons     otis          12
melogold    destin        23
milwa       charlotte      1
mixed       tavaris        5
morita      collins        3
pecans      acie           5
            shiela         2
            suzy           4
pinole      christa        5
president   diandra        1
stalk       wava           2
sunburst    belia          8
turban      andra          4

In [79]:
#error_code.SUBMIT.dt.hour.head()
#error_code.SUBMIT.dt.weekday_name.head()
#error_code.SUBMIT.dt.dayofyear.head()

0    68
1    66
2    70
3    70
4    70
Name: SUBMIT, dtype: int64

In [80]:
#get just the hour out of the SUBMIT column
#error_code['hours']=error_code['SUBMIT'].dt.hour

In [82]:
#error_code.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT,hours
0,6794220,laxtons,mikala,15488.0,7201.07,1209600,955970,1,16,production,0:0,2019-03-09 16:38:44,16
1,6983193_1880,discovery,serina,12288.0,6516.10,1188000,1070801,1,1,production,0:0,2019-03-07 18:39:59,18
2,7055502_1863,discovery,serina,12288.0,0.09,1188000,1153656,1,1,production,0:0,2019-03-11 10:06:06,10
3,7055502_1800,discovery,serina,12288.0,8333.82,1188000,1050659,1,1,production,0:0,2019-03-11 10:06:06,10
4,7055502_1806,discovery,serina,12288.0,8304.03,1188000,981826,1,1,production,0:0,2019-03-11 10:06:06,10

In [83]:
#error_code['shifter']=error_code.SUBMIT.shift()

In [84]:
#error_code.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT,hours,shifter
0,6794220,laxtons,mikala,15488.0,7201.07,1209600,955970,1,16,production,0:0,2019-03-09 16:38:44,16,NaT
1,6983193_1880,discovery,serina,12288.0,6516.10,1188000,1070801,1,1,production,0:0,2019-03-07 18:39:59,18,2019-03-09 16:38:44
2,7055502_1863,discovery,serina,12288.0,0.09,1188000,1153656,1,1,production,0:0,2019-03-11 10:06:06,10,2019-03-07 18:39:59
3,7055502_1800,discovery,serina,12288.0,8333.82,1188000,1050659,1,1,production,0:0,2019-03-11 10:06:06,10,2019-03-11 10:06:06
4,7055502_1806,discovery,serina,12288.0,8304.03,1188000,981826,1,1,production,0:0,2019-03-11 10:06:06,10,2019-03-11 10:06:06

In [87]:
#diff. in hours
#error_code['diff_hours']=error_code['SUBMIT']-error_code['shifter']
#error_code['diff_hours']=error_code['diff_hours']/np.timedelta64(1,'h')

In [91]:
#error_code.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT,hours,shifter,diff_hours
0,6794220,laxtons,mikala,15488.0,7201.07,1209600,955970,1,16,production,0:0,2019-03-09 16:38:44,16,NaT,NaN
1,6983193_1880,discovery,serina,12288.0,6516.10,1188000,1070801,1,1,production,0:0,2019-03-07 18:39:59,18,2019-03-09 16:38:44,-45.979167
2,7055502_1863,discovery,serina,12288.0,0.09,1188000,1153656,1,1,production,0:0,2019-03-11 10:06:06,10,2019-03-07 18:39:59,87.435278
3,7055502_1800,discovery,serina,12288.0,8333.82,1188000,1050659,1,1,production,0:0,2019-03-11 10:06:06,10,2019-03-11 10:06:06,0.000000
4,7055502_1806,discovery,serina,12288.0,8304.03,1188000,981826,1,1,production,0:0,2019-03-11 10:06:06,10,2019-03-11 10:06:06,0.000000

In [144]:
#error_code[error_code.diff_hours<= 4]

In [ ]:
#sort by user, the user did jobs within 4 hours, deepcopy

In [264]:
#bring in the clean data again and work on part-2 of question one. Answering the within 4 hours mark
within='data/clean_data.csv'
within_4_hours = pd.read_csv(within)

In [265]:
within_4_hours.shape

(3319256, 12)

In [266]:
within_4_hours.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
0,6794220,laxtons,mikala,15488.0,7201.07,1209600,955970,1,16,production,0:0,2019-03-09T16:38:44
1,6983193_1880,discovery,serina,12288.0,6516.10,1188000,1070801,1,1,production,0:0,2019-03-07T18:39:59
2,7055502_1863,discovery,serina,12288.0,0.09,1188000,1153656,1,1,production,0:0,2019-03-11T10:06:06
3,7055502_1800,discovery,serina,12288.0,8333.82,1188000,1050659,1,1,production,0:0,2019-03-11T10:06:06
4,7055502_1806,discovery,serina,12288.0,8304.03,1188000,981826,1,1,production,0:0,2019-03-11T10:06:06

In [267]:
#converted the submit section to datetime type
within_4_hours['SUBMIT']=pd.to_datetime(within_4_hours.SUBMIT)

In [268]:
within_4_hours.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3319256 entries, 0 to 3319255
Data columns (total 12 columns):
JOBID        object
ACCOUNT      object
USER         object
REQMEM       float64
USEDMEM      float64
REQTIME      int64
USEDTIME     int64
NODES        int64
CPUS         int64
PARTITION    object
EXITCODE     object
SUBMIT       datetime64[ns]
dtypes: datetime64[ns](1), float64(2), int64(4), object(5)
memory usage: 303.9+ MB

In [269]:
rolling_jobs=within_4_hours[within_4_hours.USEDTIME<300]

In [270]:
rolling_jobs.shape

(822925, 12)

In [271]:
rolling_jobs.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
1638,7228228,cepuna,maryann,1024.0,0.09,216000,10,1,1,production,0:0,2019-03-19 14:14:19
2077,7233860,texas,miya,10240.0,44.04,36000,123,1,1,production,0:0,2019-03-19 20:19:03
2080,7233863,texas,miya,10240.0,0.09,36000,160,1,1,production,0:0,2019-03-19 20:19:44
2282,7234166_22,fairchild,docia,1024.0,1.21,36000,243,1,1,production,0:0,2019-03-19 21:07:46
2283,7234163_42,fairchild,docia,1024.0,0.09,36000,207,1,1,production,0:0,2019-03-19 21:07:42

In [272]:
rolling_jobs=within_4_hours.groupby('USER').rolling(on='SUBMIT',window='4H').JOBID.count()

In [273]:
rolling_jobs

USER     SUBMIT
abigail  2019-03-15 15:21:59     1.0
         2019-03-18 12:24:01     1.0
         2019-03-18 12:24:09     2.0
         2019-03-18 13:42:14     3.0
         2019-03-19 07:24:26     1.0
         2019-03-19 08:27:31     2.0
         2019-03-19 08:58:08     3.0
         2019-03-19 08:56:07     4.0
         2019-03-19 08:58:02     5.0
         2019-03-18 12:24:01     6.0
         2019-03-18 12:24:01     7.0
         2019-03-18 12:24:01     8.0
         2019-03-18 12:24:01     9.0
         2019-03-18 12:24:01    10.0
         2019-03-18 12:24:01    11.0
         2019-03-18 12:24:01    12.0
         2019-03-18 12:24:01    13.0
         2019-03-18 12:24:01    14.0
         2019-03-18 12:24:01    15.0
         2019-03-18 12:24:01    16.0
         2019-03-18 12:24:01    17.0
         2019-03-18 12:24:01    18.0
         2019-03-18 12:24:01    19.0
         2019-03-18 12:24:01    20.0
         2019-03-18 12:24:01    21.0
         2019-03-18 12:24:01    22.0
         2019-03-18 12:24:01    23.0
         2019-03-18 12:24:01    24.0
         2019-03-18 12:24:01    25.0
         2019-03-18 12:24:01    26.0
                                ...
yuliana  2019-03-20 10:49:52     2.0
         2019-03-20 15:39:24     1.0
         2019-03-27 11:40:58     1.0
         2019-03-27 17:41:21     1.0
         2019-04-03 10:57:10     1.0
         2019-04-03 11:27:09     2.0
         2019-04-03 11:34:02     3.0
         2019-04-05 10:47:55     1.0
         2019-04-05 10:50:46     2.0
         2019-04-08 16:45:03     1.0
         2019-04-11 10:19:18     1.0
         2019-04-11 10:54:47     2.0
         2019-04-11 13:12:18     3.0
         2019-04-28 13:43:30     1.0
         2019-04-28 13:43:35     2.0
         2019-04-28 22:21:20     1.0
         2019-04-28 22:23:21     2.0
         2019-06-25 15:36:07     1.0
         2019-06-25 18:35:39     2.0
         2019-06-26 10:41:35     1.0
         2019-06-28 10:19:01     1.0
         2019-07-08 15:26:39     1.0
         2019-07-08 15:32:32     2.0
         2019-07-12 10:56:26     1.0
         2019-07-16 10:55:50     1.0
         2019-07-19 10:01:42     1.0
         2019-09-12 12:49:48     1.0
         2019-09-18 11:24:17     1.0
zakary   2019-07-24 02:43:50     1.0
         2019-08-11 20:47:17     1.0
Name: JOBID, Length: 3319256, dtype: float64

In [274]:
rolling_jobs=rolling_jobs[rolling_jobs>500]

In [275]:
rolling_jobs.shape

(1949293,)

In [276]:
rolling_data=pd.DataFrame(rolling_jobs)

In [277]:
#df = df.reset_index(drop=True)
rolling_data=rolling_data.reset_index()

In [278]:
rolling_data=rolling_data.rename(columns={'JOBID':'JOB_COUNT'})

In [279]:
#this answers the question 1 part 2. the number of users who 
rolling_data=rolling_data.groupby('USER')[['JOB_COUNT']].max()

In [280]:
rolling_data.head()

         JOB_COUNT
USER
adalyn      1537.0
adelina     7418.0
aileen      1485.0
alene        718.0
alf         9998.0

In [281]:
rolling_data.count()

JOB_COUNT    93
dtype: int64